---
kind: type
id: T:Autodesk.Revit.DB.FamilyPointLocation
source: html/c91d861a-ee45-48a7-103a-7dd33cac54a9.htm
---
# Autodesk.Revit.DB.FamilyPointLocation

Data corresponding to the point locations in certain types of Family Symbols.

## Syntax (C#)
```csharp
public class FamilyPointLocation : APIObject
```

## Remarks
Examples of FamilySymbol objects that contain placement references are Panels and Flexible Components.